Masmiseim36/nxpSDK/devices/MKV44F16/MKV44F16.h
/*! @name CLIST4 - ADC Channel List Register 4 */
/*! @{ */
#define ADC_CLIST4_SAMPLE12_MASK                 (0xFU)
#define ADC_CLIST4_SAMPLE12_SHIFT                (0U)
/*! SAMPLE12 - Sample Field 12
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST4_SAMPLE12(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE12_SHIFT)) & ADC_CLIST4_SAMPLE12_MASK)
#define ADC_CLIST4_SAMPLE13_MASK                 (0xF0U)
#define ADC_CLIST4_SAMPLE13_SHIFT                (4U)
/*! SAMPLE13 - Sample Field 13
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST4_SAMPLE13(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE13_SHIFT)) & ADC_CLIST4_SAMPLE13_MASK)
#define ADC_CLIST4_SAMPLE14_MASK                 (0xF00U)
#define ADC_CLIST4_SAMPLE14_SHIFT                (8U)
/*! SAMPLE14 - Sample Field 14
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST4_SAMPLE14(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE14_SHIFT)) & ADC_CLIST4_SAMPLE14_MASK)
#define ADC_CLIST4_SAMPLE15_MASK                 (0xF000U)
#define ADC_CLIST4_SAMPLE15_SHIFT                (12U)
/*! SAMPLE15 - Sample Field 15
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST4_SAMPLE15(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE15_SHIFT)) & ADC_CLIST4_SAMPLE15_MASK)
/*! @} */

/*! @name SDIS - ADC Sample Disable Register */
/*! @{ */
#define ADC_SDIS_DS_MASK                         (0xFFFFU)
#define ADC_SDIS_DS_SHIFT                        (0U)
/*! DS - Disable Sample Bits
 *  0b0000000000000000..SAMPLEx channel is enabled for ADC scan.
 *  0b0000000000000001..SAMPLEx channel is disabled for ADC scan and corresponding channels after SAMPLEx also doesn not occur in an ADC scan.
 */
#define ADC_SDIS_DS(x)                           (((uint16_t)(((uint16_t)(x)) << ADC_SDIS_DS_SHIFT)) & ADC_SDIS_DS_MASK)
/*! @} */

/*! @name STAT - ADC Status Register */
/*! @{ */
#define ADC_STAT_UNDEFINED_MASK                  (0xFFU)
#define ADC_STAT_UNDEFINED_SHIFT                 (0U)
#define ADC_STAT_UNDEFINED(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_STAT_UNDEFINED_SHIFT)) & ADC_STAT_UNDEFINED_MASK)
#define ADC_STAT_HLMTI_MASK                      (0x100U)
#define ADC_STAT_HLMTI_SHIFT                     (8U)
/*! HLMTI - High Limit Interrupt
 *  0b0..No high limit interrupt request
 *  0b1..High limit exceeded, IRQ pending if CTRL1[HLMTIE] is set
 */
#define ADC_STAT_HLMTI(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_STAT_HLMTI_SHIFT)) & ADC_STAT_HLMTI_MASK)
#define ADC_STAT_LLMTI_MASK                      (0x200U)
#define ADC_STAT_LLMTI_SHIFT                     (9U)
/*! LLMTI - Low Limit Interrupt
 *  0b0..No low limit interrupt request
 *  0b1..Low limit exceeded, IRQ pending if CTRL1[LLMTIE] is set
 */
#define ADC_STAT_LLMTI(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_STAT_LLMTI_SHIFT)) & ADC_STAT_LLMTI_MASK)
#define ADC_STAT_ZCI_MASK                        (0x400U)
#define ADC_STAT_ZCI_SHIFT                       (10U)
/*! ZCI - Zero Crossing Interrupt
 *  0b0..No zero crossing interrupt request
 *  0b1..Zero crossing encountered, IRQ pending if CTRL1[ZCIE] is set
 */
#define ADC_STAT_ZCI(x)                          (((uint16_t)(((uint16_t)(x)) << ADC_STAT_ZCI_SHIFT)) & ADC_STAT_ZCI_MASK)
#define ADC_STAT_EOSI0_MASK                      (0x800U)
#define ADC_STAT_EOSI0_SHIFT                     (11U)
/*! EOSI0 - End of Scan Interrupt
 *  0b0..A scan cycle has not been completed, no end of scan IRQ pending
 *  0b1..A scan cycle has been completed, end of scan IRQ pending
 */
#define ADC_STAT_EOSI0(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_STAT_EOSI0_SHIFT)) & ADC_STAT_EOSI0_MASK)
#define ADC_STAT_EOSI1_MASK                      (0x1000U)
#define ADC_STAT_EOSI1_SHIFT                     (12U)
/*! EOSI1 - End of Scan Interrupt
 *  0b0..A scan cycle has not been completed, no end of scan IRQ pending
 *  0b1..A scan cycle has been completed, end of scan IRQ pending
 */
#define ADC_STAT_EOSI1(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_STAT_EOSI1_SHIFT)) & ADC_STAT_EOSI1_MASK)
#define ADC_STAT_CIP1_MASK                       (0x4000U)
#define ADC_STAT_CIP1_SHIFT                      (14U)
/*! CIP1 - Conversion in Progress
 *  0b0..Idle state
 *  0b1..A scan cycle is in progress. The ADC will ignore all sync pulses or start commands
 */
#define ADC_STAT_CIP1(x)                         (((uint16_t)(((uint16_t)(x)) << ADC_STAT_CIP1_SHIFT)) & ADC_STAT_CIP1_MASK)
#define ADC_STAT_CIP0_MASK                       (0x8000U)
#define ADC_STAT_CIP0_SHIFT                      (15U)
/*! CIP0 - Conversion in Progress
 *  0b0..Idle state
 *  0b1..A scan cycle is in progress. The ADC will ignore all sync pulses or start commands
 */
#define ADC_STAT_CIP0(x)                         (((uint16_t)(((uint16_t)(x)) << ADC_STAT_CIP0_SHIFT)) & ADC_STAT_CIP0_MASK)
/*! @} */

/*! @name RDY - ADC Ready Register */
/*! @{ */
#define ADC_RDY_RDY_MASK                         (0xFFFFU)
#define ADC_RDY_RDY_SHIFT                        (0U)
/*! RDY - Ready Sample
 *  0b0000000000000000..Sample not ready or has been read
 *  0b0000000000000001..Sample ready to be read
 */
#define ADC_RDY_RDY(x)                           (((uint16_t)(((uint16_t)(x)) << ADC_RDY_RDY_SHIFT)) & ADC_RDY_RDY_MASK)
/*! @} */

/*! @name LOLIMSTAT - ADC Low Limit Status Register */
/*! @{ */
#define ADC_LOLIMSTAT_LLS_MASK                   (0xFFFFU)
#define ADC_LOLIMSTAT_LLS_SHIFT                  (0U)
#define ADC_LOLIMSTAT_LLS(x)                     (((uint16_t)(((uint16_t)(x)) << ADC_LOLIMSTAT_LLS_SHIFT)) & ADC_LOLIMSTAT_LLS_MASK)
/*! @} */

/*! @name HILIMSTAT - ADC High Limit Status Register */
/*! @{ */
#define ADC_HILIMSTAT_HLS_MASK                   (0xFFFFU)
#define ADC_HILIMSTAT_HLS_SHIFT                  (0U)
#define ADC_HILIMSTAT_HLS(x)                     (((uint16_t)(((uint16_t)(x)) << ADC_HILIMSTAT_HLS_SHIFT)) & ADC_HILIMSTAT_HLS_MASK)
/*! @} */

/*! @name ZXSTAT - ADC Zero Crossing Status Register */
/*! @{ */
#define ADC_ZXSTAT_ZCS_MASK                      (0xFFFFU)
#define ADC_ZXSTAT_ZCS_SHIFT                     (0U)
/*! ZCS - Zero Crossing Status
 *  0b0000000000000000..Either: A sign change did not occur in a comparison between the current channelx result and the previous channelx result, or Zero crossing control is disabled for channelx in the zero crossing control register, ZXCTRL
 *  0b0000000000000001..In a comparison between the current channelx result and the previous channelx result, a sign change condition occurred as defined in the zero crossing control register (ZXCTRL)
 */
#define ADC_ZXSTAT_ZCS(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_ZXSTAT_ZCS_SHIFT)) & ADC_ZXSTAT_ZCS_MASK)
/*! @} */

/*! @name RSLT - ADC Result Registers with sign extension */
/*! @{ */
#define ADC_RSLT_RSLT_MASK                       (0x7FF8U)
#define ADC_RSLT_RSLT_SHIFT                      (3U)
#define ADC_RSLT_RSLT(x)                         (((uint16_t)(((uint16_t)(x)) << ADC_RSLT_RSLT_SHIFT)) & ADC_RSLT_RSLT_MASK)
#define ADC_RSLT_SEXT_MASK                       (0x8000U)
#define ADC_RSLT_SEXT_SHIFT                      (15U)
#define ADC_RSLT_SEXT(x)                         (((uint16_t)(((uint16_t)(x)) << ADC_RSLT_SEXT_SHIFT)) & ADC_RSLT_SEXT_MASK)
/*! @} */

/* The count of ADC_RSLT */
#define ADC_RSLT_COUNT                           (16U)

/*! @name LOLIM - ADC Low Limit Registers */
/*! @{ */
#define ADC_LOLIM_LLMT_MASK                      (0x7FF8U)
#define ADC_LOLIM_LLMT_SHIFT                     (3U)
#define ADC_LOLIM_LLMT(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_LOLIM_LLMT_SHIFT)) & ADC_LOLIM_LLMT_MASK)
/*! @} */

